КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_ПунктыМаршрута/КонтурЛогистика_ПунктыМаршрута.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_ПунктыМаршрута</name>
  <attributes>
    <name>GLN</name>
    <comment>необязательно, (Global Location Number) — глобальный идентификационный номер. Он применяется для распознавания организаций, их частей и объектов: складов, магазинов, производств, автомобилей. GLN — международный код</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресИндекс</name>
    <comment>(варинат 2) Индекс - обязателен при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресКодРегион</name>
    <comment>(вариант 2) Код региона - обязателен при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресИнфАдрес</name>
    <comment>(вариант 1) Текстовое представление адреса - обязательно при указании адреса простым текстом</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресИнфКодСтраны</name>
    <comment>(вариант 1) Страна - обязательна при указании адреса простым текстом</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресГород</name>
    <comment>необязателен, используется при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресНаселПункт</name>
    <comment>необязателен, используется при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресУлица</name>
    <comment>необязателен, используется при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресРайон</name>
    <comment>необязателен, используется при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресДом</name>
    <comment>необязателен, используется при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресКорпус</name>
    <comment>необязателен, используется при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресКварт</name>
    <comment>необязателен, используется при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресПредставление</name>
    <comment>Нормализованное текстовое представление адреса по ГАР/ФИАС</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодГАР</name>
    <comment>может быть указан вместо всех других адресных полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресГАРЗначение</name>
    <comment>JSON структуры адреса ФИАС/ГАР для исходящего XDTO</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКАдресу</name>
    <comment>необязательный, передается в сообщении для всех способов задания адреса</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыДолгота</name>
    <comment>необязательно</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыШирота</name>
    <comment>необязательно</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Наш</name>
    <comment>если да, то становятся доступными расширенные настройки</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправление</name>
    <comment>Признак, что Может выступать в этой базе данных в качестве точки:отправления</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Прибытие</name>
    <comment>Признак, что Может выступать в этой базе данных в качестве точки:прибытия</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Собственник</name>
    <comment>обязателен для пунктов отгрузки. ОрганизацияДиадок, являющаяся собственником пункта маршрута. Или укажите причину почему нет данных в реквизите СобственникНеУказанПричина</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>СобственникНеУказанПричина</name>
    <comment>текстовое описание причины по которой для точки отгрузки нет сведений о её собственнике</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоступКОбъектуДоговор</name>
    <comment>ОснДостОбИнфрДок - на основании чего пользуемся складом</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступКОбъектуТекст</name>
    <comment>ОснДостОбИнфрТекст  - Основание беспрепятственного доступа к объекту инфраструктуры пункта погрузки лица, осуществляющего погрузку груза в транспортное средство: текст при отсутствии подтверждающих документов</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧасовойПояс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПартнераКонтур</name>
    <comment>Идентификатор партнера в сервисах ЭДО Контура</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СвязанныеОбъекты</name>
    <attributes>
      <name>СвязанныйОбъект</name>
      <type>
        <types>DefinedType.КонтурЛогистика_ПунктМаршрутаУчетнойСистемы</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначенияУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТелефоныПереадресующегоПоУмолчанию</name>
    <attributes>
      <name>Телефон</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактыПолучателейУведомлений</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.КонтурЛогистика_ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТрНЗамечанияОтВодителя</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрНЗамечанияОтПеревозчика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрНОтказПВ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрНОтказГП</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыКонтактнойИнформации/КонтурЛогистика_ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыКонтактнойИнформации</name>
  <enumValues>
    <name>Адрес</name>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_ПунктыМаршрута/Forms/ФормаВыбораКонтакта/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Контекст", Контекст);
	Параметры.Свойство("ТипКонтакта", ТипКонтакта);
	Параметры.Свойство("ЗначениеКонтакта", ЗначениеКонтакта);
	Параметры.Свойство("ТрНЗамечанияОтВодителя", ТрНЗамечанияОтВодителя);
	Параметры.Свойство("ТрНЗамечанияОтПеревозчика", ТрНЗамечанияОтПеревозчика);
	Параметры.Свойство("ТрНОтказПВ", ТрНОтказПВ);
	Параметры.Свойство("ТрНОтказГП", ТрНОтказГП);
	
	Если Не ЗначениеЗаполнено(ТипКонтакта) Тогда
		ТипКонтакта = Перечисления.КонтурЛогистика_ТипыКонтактнойИнформации.Телефон;
	КонецЕсли;
	
	ИспользоватьОтправкуВТелеграм = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ИспользоватьОтправкуВТелеграм");
	ИспользоватьОтправкуНаПочту = НастройкиОтправкиПочтыЗаполнены();
	
	ХешСуммаДанныхПриОткрытии = ХешСуммаДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьПодсказкуВвода();
	
	Элементы.ГруппаТелеграм.Видимость = (ИспользоватьОтправкуВТелеграм
		И ТипКонтакта = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыКонтактнойИнформации.Телефон"));
	
	Если Элементы.ГруппаТелеграм.Видимость Тогда
		Если ЗначениеЗаполнено(ЗначениеКонтакта) Тогда
			ИдетПроверкаТелефонаВТелеграм = Истина;
			ПодключитьОбработчикОжидания("ПроверитьРегистрациюТелеграм", 0.1, Истина);
		КонецЕсли;
		
		ОбновитьВидимостьГруппыТелеграм();
	КонецЕсли;
	
	ОбновитьВидимостьГруппыПочты();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеОбщейНастройки"
		И Параметр = "ИспользоватьОтправкуВТелеграм" Тогда
		
		ИспользоватьОтправкуВТелеграм = ЗначениеНастройки("ИспользоватьОтправкуВТелеграм");
		ОбновитьВидимостьГруппыТелеграм();
		
	ИначеЕсли ИмяСобытия = "ИзменениеНастройкиУчетнойЗаписиЭлектроннойПочты" Тогда
		
		ИспользоватьОтправкуНаПочту = НастройкиОтправкиПочтыЗаполнены();
		ОбновитьВидимостьГруппыПочты();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипКонтактаПриИзменении(Элемент)
	
	ОбновитьПодсказкуВвода();
	
	ОбновитьВидимостьГруппыТелеграм();
	ОбновитьВидимостьГруппыПочты();
	
	ОчиститьСообщения();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеКонтактаПриИзменении(Элемент)
	
	ОчиститьСообщения();
	
	ЗначениеКонтактаКорректно = ЗначениеКонтактаКорректно();
	
	Если ЗначениеКонтактаКорректно
		И ИспользоватьОтправкуВТелеграм
		И ТипКонтакта = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыКонтактнойИнформации.Телефон") Тогда
		Если ЗначениеЗаполнено(ЗначениеКонтакта) Тогда
			ПроверитьРегистрациюТелеграм();
		КонецЕсли;
		
		ОбновитьВидимостьГруппыТелеграм();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПодключитьТелеграмНажатие(Элемент)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"ОбщаяФорма.КонтурЛогистика_QRКодБотаКаналаТелеграм",,
		ЭтаФорма, ЭтаФорма,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Если Не ЗначениеКонтактаКорректно() Тогда
		Возврат;
	КонецЕсли;
	
	Если ИспользоватьОтправкуВТелеграм
		И ТипКонтакта = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыКонтактнойИнформации.Телефон")
		И Не ТелефонЗарегистрированВТелеграм Тогда
		
		Сообщить("Номер телефона не подключен к боту Телеграм.");
		Возврат;
	КонецЕсли;
	
	ОтправитьУведомлениеОПодключении();
	
	Результат = Новый Структура;
	Результат.Вставить("ТипКонтакта", ТипКонтакта);
	Результат.Вставить("ЗначениеКонтакта", ЗначениеКонтакта);
	Результат.Вставить("ТрНЗамечанияОтВодителя", ТрНЗамечанияОтВодителя);
	Результат.Вставить("ТрНЗамечанияОтПеревозчика", ТрНЗамечанияОтПеревозчика);
	Результат.Вставить("ТрНОтказПВ", ТрНОтказПВ);
	Результат.Вставить("ТрНОтказГП", ТрНОтказГП);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтправкуНаПочту(Команда)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"ОбщаяФорма.КонтурЛогистика_НастройкаУчетнойЗаписиЭлектроннойПочты",, ЭтаФорма, ЭтаФорма,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьПодсказкуВвода()
	
	Если ТипКонтакта = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыКонтактнойИнформации.Телефон") Тогда
		Элементы.ЗначениеКонтакта.ПодсказкаВвода = "например: 79990010101";
	Иначе
		Элементы.ЗначениеКонтакта.ПодсказкаВвода = "например: my_mail@yandex.ru";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЗначениеКонтактаКорректно()
	
	ЗначениеКонтакта = СокрЛП(ЗначениеКонтакта);
	
	Если Не ЗначениеЗаполнено(ЗначениеКонтакта) Тогда
		Сообщить("Значение не заполнено");
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипКонтакта = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыКонтактнойИнформации.Телефон") Тогда
		ЗначениеКонтакта = СтрЗаменить(ЗначениеКонтакта, " ", "");
		ЗначениеКонтакта = СтрЗаменить(ЗначениеКонтакта, "+", "");
		ЗначениеКонтакта = СтрЗаменить(ЗначениеКонтакта, "-", "");
		
		ТолькоЦифры = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СтрокаСодержитТолькоЦифры(ЗначениеКонтакта);
		
		Если Не ТолькоЦифры Тогда
			Сообщить("Номер телефона должен содержать только цифры");
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Элементы.ЗначениеКонтакта.ПодсказкаВвода = "например: my_mail@yandex.ru";
		
		Если Найти(ЗначениеКонтакта, "@") = 0 Тогда
			Сообщить("Адрес не содержит доменной части");
			Возврат Ложь;
		КонецЕсли;
		
		Если Найти(ЗначениеКонтакта, ".") = 0 Тогда
			Сообщить("Введен не верный адрес");
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьРегистрациюТелеграм()
	
	ТелефонЗарегистрированВТелеграм = ПроверитьРегистрациюТелеграмНаСервере(ЗначениеКонтакта);
	ИдетПроверкаТелефонаВТелеграм = Ложь;
	ОбновитьВидимостьГруппыТелеграм();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьГруппыТелеграм()
	
	Элементы.ГруппаТелеграм.Видимость = Ложь;
	
	Если ЗначениеЗаполнено(ЗначениеКонтакта) Тогда
		Элементы.ГруппаТелеграм.Видимость = (ИспользоватьОтправкуВТелеграм
			И ТипКонтакта = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыКонтактнойИнформации.Телефон"));
		
		Элементы.ДекорацияИдетПроверкаТелеграм.Видимость = Ложь;
		Элементы.ДекорацияРезультатУспехТелеграм.Видимость = Ложь;
		Элементы.ДекорацияПодключитьТелеграм.Видимость = Ложь;
		
		Если ИдетПроверкаТелефонаВТелеграм Тогда
			Элементы.ДекорацияИдетПроверкаТелеграм.Видимость = Истина;
		ИначеЕсли ТелефонЗарегистрированВТелеграм Тогда
			Элементы.ДекорацияРезультатУспехТелеграм.Видимость = Истина;
		Иначе
			Элементы.ДекорацияПодключитьТелеграм.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьГруппыПочты()
	
	Элементы.ГруппаПочта.Видимость = (Не ИспользоватьОтправкуНаПочту
		И ТипКонтакта = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыКонтактнойИнформации.АдресЭлектроннойПочты"));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьРегистрациюТелеграмНаСервере(Телефон)
	
	Попытка
		ТелефонЗарегестрированВТелеграм = КонтурЛогистика_РаботаСТелеграм.ТелефонЗарегестрирован(Телефон);
	Исключение
		ТелефонЗарегестрированВТелеграм = Ложь;
	КонецПопытки;
	
	Возврат ТелефонЗарегестрированВТелеграм;
	
КонецФункции

&НаСервереБезКонтекста
Функция НастройкиОтправкиПочтыЗаполнены()
	
	Возврат КонтурЛогистика_РаботаСПочтовымиСообщениями.НастройкиОтправкиПочтыЗаполнены();
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗначениеНастройки(ИмяПредопределенного)
	
	Возврат Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки(ИмяПредопределенного);
	
КонецФункции

&НаСервере
Процедура ОтправитьУведомлениеОПодключении()
	
	ТекущаяХешСуммаДанных = ХешСуммаДанных();
	
	Если ТекущаяХешСуммаДанных = ХешСуммаДанныхПриОткрытии Тогда
		Возврат;
	КонецЕсли;
	
	// Вам будут направляться уведомления о замечаниях водителей по организации: Тестовый 1С ПВ.
	
	// Формируем текст сообщения
	ШаблонТекстаСообщения = КонтурЛогистика_РаботаСТелеграм.СимволЭмоджи("BELL")
		+ " Вам будут направляться уведомления %1 %2.";
	
	Если ТрНЗамечанияОтВодителя И ТрНЗамечанияОтПеревозчика Тогда
		ТекстЗамечанийВодителя = "о замечаниях водителей и перевозчиков";
	ИначеЕсли ТрНЗамечанияОтВодителя Тогда
		ТекстЗамечанийВодителя = "о замечаниях водителей";
	ИначеЕсли ТрНЗамечанияОтВодителя Тогда
		ТекстЗамечанийВодителя = "о замечаниях перевозчиков";
	Иначе
		ТекстЗамечанийВодителя = "";
	КонецЕсли;
	
	Если ТрНОтказПВ И ТрНОтказГП Тогда
		ТекстОтказаПВиГП = "об отказах перевозчика и частичных приемках/отказах грузополучателя";
	ИначеЕсли ТрНОтказПВ Тогда
		ТекстОтказаПВиГП = "об отказах перевозчика";
	ИначеЕсли ТрНОтказГП Тогда
		ТекстОтказаПВиГП = "об отказах и частичных приемках грузополучателя";
	Иначе
		ТекстОтказаПВиГП = "";
	КонецЕсли;
	
	ТекстОтправителя = ТекстЗамечанийВодителя;
	Если ТекстОтправителя = "" Тогда
		ТекстОтправителя = ТекстОтказаПВиГП;
	Иначе
		ТекстОтправителя = ТекстОтправителя + " и " + ТекстОтказаПВиГП;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекстОтправителя) Или Не ЗначениеЗаполнено(Контекст) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Контекст) = Тип("СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок") Тогда
		ТекстКонтекста = "по организации: "
			+ КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(Контекст, "Наименование");
	ИначеЕсли ТипЗнч(Контекст) = Тип("СправочникСсылка.КонтурЛогистика_ПунктыМаршрута") Тогда
		ТекстКонтекста = "по адресу: "
			+ Справочники.КонтурЛогистика_ПунктыМаршрута.ПредставлениеАдреса_(Контекст);
	Иначе
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(
		ШаблонТекстаСообщения, ТекстОтправителя, ТекстКонтекста);
	
	Если ИспользоватьОтправкуВТелеграм И ТипКонтакта = Перечисления.КонтурЛогистика_ТипыКонтактнойИнформации.Телефон Тогда
		СообщениеВТелеграм = КонтурЛогистика_РаботаСТелеграм.МанифестСообщения();
		СообщениеВТелеграм.Тип = "text";
		СообщениеВТелеграм.Данные = КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьДвоичныеДанныеИзСтроки_КонтурЛогистика(ТекстСообщения);
		
		СообщенияВТелеграм = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СообщениеВТелеграм);
		
		КонтурЛогистика_РаботаСТелеграм.ОтправитьСообщения(ЗначениеКонтакта, СообщенияВТелеграм);
	ИначеЕсли ИспользоватьОтправкуНаПочту И ТипКонтакта = Перечисления.КонтурЛогистика_ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
		Письмо = Новый ИнтернетПочтовоеСообщение;
		Письмо.Тема = "Подключено получение уведомлений";
		Письмо.Тексты.Добавить(ТекстСообщения, ТипТекстаПочтовогоСообщения.ПростойТекст);
		Письмо.Получатели.Добавить(ЗначениеКонтакта);
		
		ТекстОшибки = КонтурЛогистика_РаботаСПочтовымиСообщениями.ОтправитьПисьмо(Письмо);
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ЗаписьЖурналаРегистрации("КонтурЛогистика_ОтправкаУведомлений",
				УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ХешСуммаДанных()
	
	ВходныеДанныеРасчета = Строка(ТипКонтакта)
		+ Строка(ЗначениеКонтакта)
		+ Строка(ТрНЗамечанияОтВодителя)
		+ Строка(ТрНЗамечанияОтПеревозчика)
		+ Строка(ТрНОтказПВ)
		+ Строка(ТрНОтказГП);
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСервер.ХешСумма(ВходныеДанныеРасчета);
	
КонецФункции

#КонецОбласти
